//#include"Heap.h"
//int main()
//{
//	//Heap hp;
//	//int nums[] = { 1,2,3,27,15,19,18,28,34,65,49,25,37 ,99};
//	//int sz = sizeof(nums) / sizeof(nums[0]);
//	//
//	//HeapCreate(&hp, nums, sz);
//
//	//HeapPush(&hp, 14);
//
//	//HeapPop(&hp);
//
//	//printf("\n");
//	//int top = HeapTop(&hp);
//	//printf("%d ", top);
//
//	//printf("\n");
//	//int size = HeapSize(&hp);
//	//printf("%d\n ", size);
//
//	//printf("\n");
//	//PrintTopK(nums, sz, 3);
//
//
//	int n = 10000;
//	int* a = (int*)malloc(sizeof(int)*n);
//	srand(time(0));
//	//随机生成10000个数存入数组，保证元素都小于1000000
//	for (size_t i = 0; i < n; ++i)
//	{
//		a[i] = rand() % 1000000;
//	}
//	//确定10个最大的数
//	a[5] = 1000000 + 1;
//	a[1231] = 1000000 + 2;
//	a[531] = 1000000 + 3;
//	a[5121] = 1000000 + 4;
//	a[115] = 1000000 + 5;
//	a[2335] = 1000000 + 6;
//	a[9999] = 1000000 + 7;
//	a[76] = 1000000 + 8;
//	a[423] = 1000000 + 9;
//	a[3144] = 1000000 + 10;
//
//	PrintTopK(a, n, 10);
//	//HeapDestory(&hp);
//	return 0;
//}
//
////void TestTopk()
////{
////	int n = 10000;
////	int* a = (int*)malloc(sizeof(int)*n);
////	srand(time(0));
////	//随机生成10000个数存入数组，保证元素都小于1000000
////	for (size_t i = 0; i < n; ++i)
////	{
////		a[i] = rand() % 1000000;
////	}
////	//确定10个最大的数
////	a[5] = 1000000 + 1;
////	a[1231] = 1000000 + 2;
////	a[531] = 1000000 + 3;
////	a[5121] = 1000000 + 4;
////	a[115] = 1000000 + 5;
////	a[2335] = 1000000 + 6;
////	a[9999] = 1000000 + 7;
////	a[76] = 1000000 + 8;
////	a[423] = 1000000 + 9;
////	a[3144] = 1000000 + 10;
////
////	PrintTopK(a, n, 10);
////}
